In [24]:
import boto3
import configparser

In [25]:
parser = configparser.ConfigParser()

In [28]:
parser.read('.config')

['.config']

In [36]:
data_path = parser['PATH']['DATA']
build_path = parser['PATH']['BUILD_DATA']
weather_path = parser['PATH']['WEATHER_DATA']
bucket_name = parser['PATH']['BUCKET']

In [16]:
AWS_KEY = parser['AWS']['ACCESS_KEY']
SECRET_KEY = parser['AWS']['SECRET_KEY']

In [30]:
s3 = boto3.resource('s3',
                   aws_access_key_id=AWS_KEY,
                   aws_secret_access_key= SECRET_KEY)
client = boto3.client('s3')
bucket = s3.Bucket(bucket)

In [44]:
import pandas as pd
pd.read_csv(build_path)

,site_id,building_id,primary_use,square_feet,year_built,floor_count
0,0,0,Education,7432,2008.0,NaN
1,0,1,Education,2720,2004.0,NaN
2,0,2,Education,5376,1991.0,NaN
3,0,3,Education,23685,2002.0,NaN
4,0,4,Education,116607,1975.0,NaN
...,...,...,...,...,...,...
1444,15,1444,Entertainment/public assembly,19619,1914.0,NaN
1445,15,1445,Education,4298,NaN,NaN
1446,15,1446,Entertainment/public assembly,11265,1997.0,NaN
1447,15,1447,Lodging/residential,29775,2001.0,NaN
1448,15,1448,Office,92271,2001.0,NaN

In [39]:
weather_path = "/udacity/unprocessed_data/weather_train.csv"